{
    "primary-missions": [
        {
            "Name": "Incisive Attack",
            "MissionRules": {
                "Name": "Sweep and Clear",
                "Rule": "In this mission, if you control an objective marker at the end of your Command phase, it remains under your control, even if you have no models within range of it, unless your opponent controls it at the end of any subsequent phase."
            },
            "PrimaryObjective": {
                "Name": "Take and Hold",
                "Type":"Progressive Objective",
                "ObjectiveList": [
                    "They control one or more objective markers",
                    "They control two or more objective markers",
                    "They control more objective markers than their opponent controls"
                ]
            },
            "SecondaryObjective": {
                "Name": "Surgical Assault",
                "Type": "Progressive Objective",
                "ObjectiveList": ["Score 5 victory points if you control the objective marker in your opponent's deployment zone at the end of your turn."]
            },
            "MissionMap": "incisiveattack.png"
        },
        {
            "Name": "Outriders",
            "PrimaryObjective": {
                "Name": "Take and Hold",
                "Type":"Progressive Objective",
                "ObjectiveList": [
                    "They control one or more objective markers",
                    "They control two or more objective markers",
                    "They control more objective markers than their opponent controls"
                ]
                
            },
            "SecondaryObjective": {
                "Name": "Survey",
                "Type": "Progressive Objective",
                "ObjectiveList": ["Score 5 victory points if you control both of the objective markers that are not in either player's deployment zone at the end of your Command phase. This secondary objective cannot be scored in the first battle round."]
            },
            "MissionMap": "outriders.png"
        },
        {
            "Name": "Encircle",
            "PrimaryObjective": {
                "Name": "Take and Hold",
                "Type":"Progressive Objective",
                "ObjectiveList": [
                    "They control one or more objective markers",
                    "They control two or more objective markers",
                    "They control more objective markers than their opponent controls"
                ]
            },
            "SecondaryObjective": {
                "Name": "Encircle",
                "Type":"Progressive Objective",
                "ObjectiveList": ["Score 3 victory points if you have at least one unit from your army (excluding aircraft) wholly within 6\" of your battlefield edge at the end of your turn and at least one unit from your army (excluding aircraft) wholly within 6\" of your opponent's battlefield edge at the end of your turn (score 5 victory points instead if one of these units is also wholly within your opponent's deployment zone)"]
            },
            "MissionMap": "encircle.png"
        },
        {
            "Name": "Divide and Conquer",
            "PrimaryObjective": {
                "Name": "Take and Hold",
                "Type":"Progressive Objective",
                "ObjectiveList": [
                    "They control one or more objective markers",
                    "They control two or more objective markers",
                    "They control more objective markers than their opponent controls"
                ]
            },
            "SecondaryObjective": {
                "Name": "Lines of Demarcation",
                "Type":"Progressive Objective",
                "ObjectiveList":["At the end of your turn, you score 4 victory points if you control both objective markers labelled A, or 2 victory points if control both objective markers labelled B."]
            },
            "MissionMap": "divideandconquer.png"
        },
        {
            "Name": "Crossfire",
            "PrimaryObjective": {
                "Name": "Take and Hold",
                "Type":"Progressive Objective",
                "ObjectiveList": [
                    "They control one or more objective markers",
                    "They control two or more objective markers",
                    "They control more objective markers than their opponent controls"
                ]
            },
            "MissionRules":{
                "Name": "Crossfire",
                "Rule": "When resolving attacks against units that are within 9\" of the centre of the battlefield, those attacks ignore the benefits of cover provided you can satisfy at least one of the following conditions:\n- You control both objective markers labelled A and the attacking model's unit is in range of an objective marker labelled A.\n- You control both objective markers labelled B and the attacking model's unit is in range of an objective marker labelled B."
            },
            "SecondaryObjective": {
                "Name": "Outflank",
                "Type":"Progressive Objective",
                "ObjectiveList":["At the end of your command phase, you score 3 victory points if you control both of the objective markers labelled A. Score 5 victory points instead if, at the end of your command phase, you control both of the objective markers labelled A and there is at least on enemy unit within 9\" of the centre of the battlefield. This secondary objective cannot be scored in the first battle round."]
            },
            "MissionMap": "crossfire.png"
        },
        {
            "Name": "Centre Ground",
            "PrimaryObjective": {
                "Name": "Take and Hold",
                "Type":"Progressive Objective",
                "ObjectiveList": [
                    "They control one or more objective markers",
                    "They control two or more objective markers",
                    "They control more objective markers than their opponent controls"
                ]
            },
            "SecondaryObjective": {
                "Name": "Centre Ground",
                "Type":"Progressive Objective",
                "ObjectiveList":["Each time a unit from your army succesfully completes the following action, you score 3 victory points if you control one of the objective markers labelled A, or 5 victory points if you currently control both objective markers labelled A."],
                "Action":{
                    "Name": "Centre Ground",
                    "Action": "One unit from your army can start to perform this action at the end of your Movement phase if it is within range of an objective marker labelled A and no enemy units (excluding AIRCRAFT) are within range of that objective marker. The action is completed at the end of your next Command phase so long as the unit performing it is still within range of the same objective marker."
                }
            },
            "MissionMap": "centreground.png"
        
        },
        {
            "Name": "Forward Push",
            "PrimaryObjective": {
                "Name": "Take and Hold",
                "Type":"Progressive Objective",
                "ObjectiveList": [
                    "They control one or more objective markers",
                    "They control two or more objective markers",
                    "They control more objective markers than their opponent controls"
                ]
            },
            "MissionRules":{
                "Name": "Quick March",
                "Rule": "Any Advance rolls of less than 3 made in the first battle round instead count as 3."
            },
            "SecondaryObjective": {
                "Name": "Forward Push",
                "Type":"Progressive Objective",
                "ObjectiveList":["If you select this object then units in your army can perform the following action: "],
                "Action": {
                    "Name": "Forward Push",
                    "Action": "One unit in your army can start to perform this action at the start of your Movement Phase if it is within range of an objective marker that you control. The action is completed at the end of your turn and you score a number of victory points depending on which objective marker this action was performed on:"
                },
                "ObjectiveTable": {
                    "Headings": [
                        "Objective Marker",
                        "Blue Victory Points",
                        "Red Victory Points"
                    ],
                    "Rows":[
                        ["A", 1, 8],
                        ["B", 2, 4],
                        ["C", 4, 2],
                        ["D", 8, 1]
                    ]
                }
            },
            "MissionMap": "forwardpush.png"
            
        
        },
        {
            "Name": "Ransack",
            "PrimaryObjective": {
                "Name": "Domination",
                "Type":"Progressive Objective",
                "ObjectiveList": [
                    "They control two or more objective markers",
                    "They control three or more objective markers",
                    "They control more objective markers than their opponent controls"
                ]
            },
            "SecondaryObjective": {
                "Name": "Ransack",
                "Type":"Progressive Objective",
                "ObjectiveList":["Score a number of victory points at the end of your Command phase if you control one or more of the objective markers that are within your opponent's territory, as shown on the table below:"],
                "ObjectiveTable":{
                    "Headings": [
                        "Number of objective markers in opponent's territory you control",
                        "Victory points scored"
                    ],
                    "Rows":[
                        [1, 2],
                        [2, 3],
                        [3, 5]
                    ]
                }
            },
            "MissionMap": "ransack.png"
        
        },
        {
            "Name": "Shifting Front",
            "PrimaryObjective": {
                "Name": "Take and Hold",
                "Type":"Progressive Objective",
                "ObjectiveList": [
                    "They control one or more objective markers",
                    "They control two or more objective markers",
                    "They control more objective markers than their opponent controls"
                ]
            },
            "MissionRules":{
                "Name": "Supply Lines",
                "Rule": "In this mission, a player only receives the Battle-forged CP bonus at the start of their Command phase if they control the objective in their deployment zone."
            },
            "SecondaryObjective": {
                "Name": "Test Their Line",
                "Type":"Progressive Objective",
                "ObjectiveList":["Score 3 victory points at the end of your turn if two or more units from your army (excluding AIRCRAFT) are wholly within your opponent's deployment zone and at least two different battlefield edges have at least one those units wholly within 6\" of them (if one of those edges is yout opponent's battlefield edge, score 5 victory points instead). For the purposes of this objective, a unit can only count as being wholly within 6\" of one battlefield edge at a time - if a unit is with 6\" of two battlefield edges because it is in the corner of the battlefiled, you can select which edge it counts as being wholly within 6\" of at the end of your turn." ]
            },
            "MissionMap": "shiftingfront.png"
        
        },
        {
            "Name": "Retrieval Mission",
            "PrimaryObjective": {
                "Name": "Take and Hold",
                "Type":"Progressive Objective",
                "ObjectiveList": [
                    "They control one or more objective markers",
                    "They control two or more objective markers",
                    "They control more objective markers than their opponent controls"
                ]
            },
            "SecondaryObjective": {
                "Name": "Minimise Losses",
                "Type":"End Game Objective",
                "ObjectiveList":["At the start of the battle, add up the number of units in oyur army - this is your army's Strength. If a unit splits to form two or more individual units during the battle, then immediately increase your army's Strength accordingly (e.g. if one unit in your army splits to form three individual units, your army's Strength is increased by 2). If a unit merges with another to form a combined unit during the battle, then decrease your army's strength accordingly (e.g. if two units from your army erge to form one unit, you immediately decrease your army's Strength by 1). At the end of the battle, add up how many units from your army are left on the battlefield, including all units embarked within TRANSPORTS, but excluding all units that have been added to your army during the battle. If the total is 75% or more of your army's Strength, score 15 points; if the total is less than 75%, but is 50% or more of your army's strength, score 10 victory points; if the total is less than 50%, but is 25% or more of your army's Strength, score 5 victory points."]
            },
            "MissionMap": "retrievalmission.png"
        
        },
        {
            "Name": "Front-Line Warfare",
            "PrimaryObjective": {
                "Name": "Take and Hold",
                "Type":"Progressive Objective",
                "ObjectiveList": [
                    "They control one or more objective markers",
                    "They control two or more objective markers",
                    "They control more objective markers than their opponent controls"
                ]
            },
            "SecondaryObjective": {
                "Name": "Vital Ground",
                "Type":"Progressive Objective",
                "ObjectiveList":["At the end of each of your Command phases, you score 3 victory points if you control the objective marker in your opponent's deployment zone, and score 2 victory points for each objective you control for each objective marker you control that is not in either player's deployment zone (for a maximum of 7 victory points). This secondary objective cannot be scored in the first battle round."]
            },
            "MissionMap": "frontlinewarfare.png"
        },
        {
            "Name": "The Four Pillars",
            "PrimaryObjective": {
                "Name": "Take and Hold",
                "Type":"Progressive Objective",
                "ObjectiveList": [
                    "They control one or more objective markers",
                    "They control two or more objective markers",
                    "They control more objective markers than their opponent controls"
                ]
            },
            "MissionRules": {
                "Name": "The Pillars",
                "Rule": "In this mission, Reinforcement units cannot be set up within range of any objective markers."
            },
            "SecondaryObjective": {
                "Name": "Siphon Power",
                "Type":"Progressive Objective",
                "ObjectiveList":["If you select this objective, units in your army can perform the following action: "],
                "Action": {
                    "Name": "Siphon Power",
                    "Action": "One or more units from your army can start to perform this action at the end of your Movement phase. Each unit that starts to perform this action must be within range of a different objective. A unit cannot start this action while any enemy units (excluding AIRCRAFT) are in range of the same objective marker. The action is completed at the end of your next Command phase, and you score a number of victory points depending on how many units completed this action this phase, as shown in the table below:"
                },
                "ObjectiveTable":{
                    "Headings":[
                        "Siphon Power Actions",
                        "Victory Points"
                    ],
                    "Rows": [
                        [1, 1],
                        [2, 3],
                        [3, 6],
                        [4, 10]
                    ]
                }
            },
            "MissionMap": "thefourpillars.png"
        
        },
        {
            "Name": "No Man's Land",
            "PrimaryObjective": {
                "Name": "Take and Hold",
                "Type":"Progressive Objective",
                "ObjectiveList": [
                    "They control one or more objective markers",
                    "They control two or more objective markers",
                    "They control more objective markers than their opponent controls"
                ]
            },
            "MissionRules": {
                "Name": "No Man's Land",
                "Rule": "If a unit has a pre-battle rule that allows it to be set up anywhere on the battlefield, that unit must still be set up wholly within your deployment zone. If a unit has a pre-battle rule that allows it to make a move, it must end that move wholly within your deployment zone."
            },
            "SecondaryObjective": {
                "Name": "Secure No Man's Land",
                "Type":"Progressive Objective",
                "ObjectiveList":["At the end of each of your turns, if you control the central objective marke you score a number of victory points equal to the current battle round number (so 1 victory point in the first battle round, 2 victory points in the second battle round etc.)."]
            },
            "MissionMap": "nomansland.png"
        
        },
        {
            "Name": "Scorched Earth",
            "PrimaryObjective": {
                "Name": "Take and Hold",
                "Type":"Progressive Objective",
                "ObjectiveList": [
                    "They control one or more objective markers",
                    "They control two or more objective markers",
                    "They control more objective markers than their opponent controls"
                ]
            },
            "SecondaryObjective": {
                "Name": "Raze",
                "Type":"End Game Objective",
                "ObjectiveList":["At the end of the battle, a player scores 5 victory points if one objective marker was removed from the battlefield due to a successful Raze Objective action performed by a unit from their army during the battle, and 15 victory points if two objective markers were so removed."]
            },
            "MissionRules":{
                "Name": "Raze Objective (Action)",
                "Rule": "One unit from your army can start to perform this action at the start of your Movement phase if it is within range of an objective that can be razed and no enemy units (excluding AIRCRAFT) are within range of that objective marker. Blue player can only attempt to raze the objective markers labelled B, and red player can only attempt to raze the objective markers labelled A. The action is completed at the end of your turn. If this action is successfully completed, that objective marker is razed and removed from the battlefield."
            },
            "MissionMap": "scorchedearth.png"
        
        },
        {
            "Name": "Vital Intelligence",
            "PrimaryObjective": {
                "Name": "Domination",
                "Type":"Progressive Objective",
                "ObjectiveList": [
                    "They control two or more objective markers",
                    "They control three or more objective markers",
                    "They control more objective markers than their opponent controls"
                ]
            },
            "MissionRules": {
                "Name": "Data Terminals",
                "Rule": "The objective markers in this mission represent data terminals. In this mission, if you control an objective marker at the end of your Command phase, it remains under your control unless your opponent controls it at the end of any subsequent phase, even if you hve no models within range of it."
            },
            "SecondaryObjective": {
                "Name": "Data Intercept",
                "Type":"Progressive Objective",
                "ObjectiveList":["Each time a unit from your army successfully completes the following action, you score a number of points equal to the number of objective markers you currently control:"],
                "Action": {
                    "Name": "Data Intercept",
                    "Action": "One unit from your army can start to perform this action at the end of your Movement phase if it is within range of an objective marker and no enemy units (excluding AIRCRAFT) are within range of that objective marker. The action is completed at the end of your next Command phase so long as the unit performing it is still within range of the same objective marker."
                }
            },
            "MissionMap": "vitalintelligence.png"
        
        },
        {
            "Name": "Lines Of Battle",
            "PrimaryObjective": {
                "Name": "",
                "Type":"Progressive Objective",
                "ObjectiveList": [
                ]
            },
            "SecondaryObjective": {
                "Name": "",
                "Type":"Progressive Objective",
                "ObjectiveList":[]
            }
        
        },
        {
            "Name": "All-Out War",
            "PrimaryObjective": {
                "Name": "",
                "Type":"Progressive Objective",
                "ObjectiveList": [
                ]
            },
            "SecondaryObjective": {
                "Name": "",
                "Type":"Progressive Objective",
                "ObjectiveList":[]
            }
        
        },
        {
            "Name": "Pathway To Glory",
            "PrimaryObjective": {
                "Name": "",
                "Type":"Progressive Objective",
                "ObjectiveList": [
                ]
            },
            "SecondaryObjective": {
                "Name": "",
                "Type":"Progressive Objective",
                "ObjectiveList":[]
            }
        
        }
    ]
}